Repository: AlloyMagnetic/drupal-imce
Catalog: pot/*.po
Languages: he

source: Provides an image browser for tinyMCE.
he: מספק דפדפן תמונות עבור tinyMCE

source: Directory error!
he: שגיאה בתיקיה!

source: filename
he: שם קובץ

source: size
he: גודל

source: dimensions
he: מימדים

source: date
he: תאריך

source: operations
he: פעולות

source: delete
he: מחיקה

source: Delete?
he: מחק?

source: add
he: הוספה

source: Directory is empty.
he: התיקיה ריקה.

source: Upload File
he: טען קובץ

source: Scale if necessary
he: התאמת גודל התמונה במידת הצורך

source: Limits
he: מגבלות

source: File size
he: גודל קובץ

source: Dimensions
he: מימדים

source: Quota
he: מיכסת טעינה

source: No limits for you!
he: אין עבורך מגבלות

source: Image Browser
he: דפדפן תמונות

source: This is not an image! Continue?
he: קובץ זה אינו תמונה! האם להמשיך?

source: No files were uploaded.
he: לא נטענו קבצים.

source: File upload error. Could not move uploaded file.
he: שגיאה בטעינת קובץ. לא יכול להעביר את הקובץ שנטען.

source: Filename is too long(>32 chars).
he: שם הקובץ ארוך מדי (יותר מ-32 תוים)

source: Invalid filename.
he: שם הקובץ אינו תקין.

source: Only images with .jpg, .gif, and .png extensions are allowed.
he: מותרות רק תמונות עם סיומת jpg, gif ו-png.

source: Error scaling image.
he: שגיאה בהתאמת גודל התמונה.

source: Image was scaled to allowed dimensions.
he: התמונה הותאמה למימדים המותרים.

source: Image dimensions exceed the limit.
he: מימדי התמונה עולים על המגבלה המותרת.

source: Invalid file extension. Allowed extensions are .jpg, .gif, .png, %ext
he: סיומת הקובץ אינה תקינה. הסיומות המותרות הן jpeg, gif, png, %ext

source: File size exceeds upload limit.
he: גודל הקובץ עולה על המגבלה המותרת לטעינה.

source: You have not enough free space.
he: אין לך מספיק מקום פנוי.

source: Error copying the file.
he: שגיאה בהעתקת הקובץ.

source: Upload successful.
he: טעינת הקובץ הצליחה.

source: File deleted successfully.
he: הקובץ נמחק בהצלחה.

source: Error deleting file.
he: שגיאה במחיקת הקובץ.

source: Error opening directory
he: שגיאה בפתיחת תיקיה

source: Image dimensions
he: מימדי התמונה

source: Width
he: רוחב

source: Height
he: גובה

source: Define the maximum dimensions for an image to be uploaded.
he: הגדרת המימדים המקסימליים של תמונה שתיטען לאתר

source: Enable resizing
he: אפשר שינוי גודל

source: Check this if you want big images to be resized to allowed dimensions. Note that, image resizing increases script execution time.
he: סימון אפשרות זו יגרום להקטנת תמונות גדולות כדי להתאימן למימדים המותרים. לתשומת לב - שינוי גודל התמונה מגדיל את זמן טעינת התמונה.

source: Define the maximum file size(KB) for an image to be uploaded.
he: גודל הקובץ המקסימלי המותר(בקילובייט) של תמונה שתיטען לאתר

source: Upload quota
he: מיכסת טעינה

source: Define the total upload quota(KB) per user.
he: מיכסת הטעינה המקסימלית לכל משתמש, בקילובייט

source: Prefix for personal folder names
he: קידומת לשמות התיקיות האישיות

source: Define the prefix that user IDs will be appended in order to create personal folders. Ex: entering "u" will result in folder names like u1, u14 etc. If you leave it blank, user IDs will be used as folder names.
he: הגדרת הקידומת שתתווסף למזהים של חברי האתר כדי ליצור תיקיות אישיות. לדוגמה, הכנס "u" תגרום לתיקיות בשמות כגון u1, u14 וכו. אם שדה זה ריק, שמות התיקיות יהיו זהים למזהים של חברי האתר.

source: Use a shared folder
he: שימוש בתיקיה משותפת

source: If you want all your users to <strong>use a common folder instead of personal folders</strong>, here you can define that folder name (ex. images). Notice that shared upload means shared quota. If you are happy with personal folders leave this field blank.
he: אם רוצים שכל המשתמשים של טוען הקבצים <strong>ישתמשו בתיקיה משותפת במקום בתיקיות פרטיות</strong>, כאן ניתן להגדיר את שם התיקיה (לדוגמה: תמונות). לתשומת לבך - תיקיה משותפת פירושה מכסה משותפת. אם תיקיות אישיות זה מספיק טוב עבורך, אפשר להשאיר את השדה ריק.

source: Non-image file support
he: תמיכה בקבצים שאינם תמונות

source: Although imce is mainly designed to browse images, it supports uploading and browsing of any file type. If you like to use this feature, define your <strong>allowed non-image file extensions</strong> here with a comma between them. Ex .doc, .pdf, .zip. Note that, image upload limits also apply for these files. For a pure image browser leave this field blank.
he: למרות שטוען התמונות מתוכנן בעיקר לדפדוף בתמונות, הוא תומך גם בטעינה דפדוף של סוגים אחרים של קבצים. אם ברצונך לאפשר תכונה זו, יש להגדיר כאן את <strong>סיומות הקבצים שאינם תמונה המותרות</strong> ולהפריד את הסיומות בפסיקים. לדוגמה: <span style="directon:ltr">.doc, .pdf, .zip.</span>. לתשומת לב, מגבלות הטעינה תקפות גם לקבצים אלו. אם ברצונך בדפדפן תמונות בלבד, יש להשאיר שדה זה ריק.

source: Enable sorting
he: אפשר מיון

source: Check this to enable sorting of files according to their filename, filesize, file modification date, and image dimensions. Sorting is javascript-based, thus there is no need for page refresh and sorting speed depends on the client computer.
he: סימון אפשרות זו יאפשר מיון של הקבצים שנטענו לפי שם הקובץ, גודל הקובץ, זמן העדכון, ומימדי התמונה. המיון מבוסס ג'אווהסקריפט, ולכן אין צורך ברענון של העמוד ומהירות המיון תלויה במחשב הגולש.

source: view files
he: צפייה בקבצים

source: upload files
he: טעינת קבצים

source: delete files
he: מחיקת קבצים

source: limitless upload
he: טעינה ללא מגבלות

source: imce
he: טוען התמונות
